-- phpMyAdmin SQL Dump
-- version 4.7.3
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Час створення: Квт 18 2018 р., 13:39
-- Версія сервера: 5.6.37
-- Версія PHP: 5.5.38

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База даних: `babystore`
--

-- --------------------------------------------------------

--
-- Структура таблиці `category`
--

CREATE TABLE `category` (
  `category_id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `description` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп даних таблиці `category`
--

INSERT INTO `category` (`category_id`, `name`, `description`) VALUES
(1, 'Конструктори', 'Конструктор — набір деталей, кріпильних елементів або деталей з кріпильними елементами, інструменту (при необхідності), призначених для багаторазового збирання різноманітних конструкцій.'),
(2, 'Машинки', 'Дитячі машинки-каталки, машинки-штовхачі, мотоцикли, автомобілі, поніцикли, толокари, ролоцикли.'),
(3, 'Настільні ігри', 'Настільні ігри - це можливість повернутись до живого спілкування, разом весело і з користю провести час.'),
(4, 'Музичні іграшки ', 'Яскраві розвиваючі іграшки з музикою розвеселять малюка приємними мелодіями, забавними звуками і миготливими вогниками.');

-- --------------------------------------------------------

--
-- Структура таблиці `product`
--

CREATE TABLE `product` (
  `product_id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `short_description` varchar(255) NOT NULL,
  `description` text NOT NULL,
  `image` varchar(255) NOT NULL,
  `price` decimal(15,4) NOT NULL,
  `category_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп даних таблиці `product`
--

INSERT INTO `product` (`product_id`, `name`, `short_description`, `description`, `image`, `price`, `category_id`) VALUES
(1, 'Конструктор \"Фермерський ринок\"', 'Чудова ілюстрація ринкових відносин, фінансових взаємозвязків та професійних особливостей', 'Серія DUPLO розроблена спеціально для самих маленьких почитателей конструкторів і актуальна для дітей старше півтора років. Мастера легендарного бренда LEGO, що обріло величезну популярність в різних куточках планет, пропонують звернути увагу на \"Фермерський ринок\", який складається з 26 деталей. Набор 10816 - відмінна ілюстрація ринкових відносин, фінансових взаємозв\'язків та професійних особливостей. Іграя в продавця або покупця, дитина пойме особливості соціальних ролей. Несмотря на невелику кількість елементів конструктор відрізняється безліччю цікавих деталей. Набір передбачає наявність одномісної машини яскравого жовтого кольору, повного ящика з яблоками, овочів, касового апарату та навіть крохотної птички. Так само в колекції непоседа з\'являється три нові мініфігурки.', '01_constructors/01_constructor_fermersky_rynok.jpg', '549.0000', 1),
(2, 'Конструктор \"Бемц\"', 'Мощний позашляховик від LEGO - відмінний презент, який подарує дітям масу позитивних емоцій від збирання та гри з авто.', 'Мощний позашляховик від LEGO - відмінний презент, який подарує дітям масу позитивних емоцій від збирання та гри з авто. Інерційна модель складається з 139 деталей, тому над її створенням доведеться добре потрудитися. Авто відрізняється уважно розробленим ефектним дизайном, який поєднує яскраві акценти та масивні деталі. Конструкція позашляховика не тільки практична, але й функціональна. Завдяки великим колесам машина може їздити навіть самої екстремальної поверхні. Щоб модель виглядала ще більш привабливою, майстри бренда пропонують прикрасити її викликаючими наклейками. Єдинственная попередження - при сильному зіткненні з бампером спрацьовує функція \"вибуху\" мотора. Конструктор актуальний для дітей старше семи років.', '01_constructors/02_constructor_bemts.jpg', '479.0000', 1),
(3, 'Ігровий набір \"Робоча машинка\", самоскид', 'Колекція міні-техніки для будівництва сподобається будь-якому хлопчикові.', 'Колекція міні-техніки для будівництва сподобається будь-якому хлопчикові. Самоскид, бетономішалка, екскаватор, асфальтоукладальник, навантажувач, бульдозер легко поміщаються в кишеню і супроводжують маленького інженера на прогулянках і в подорожах. Міні-автомобілі з міцного пластику легко поміщаються в кишеню. Кожна машинка має рухливі деталі. Вік: з 18 місяців Матеріал: пластик Розміри: 19х27х7 см Комплектація: 8 машинок Виробник: Huile Toys Зроблено в: Китай', '02_cars/03_igrovy_nabir_samosval.jpg', '391.0000', 2),
(4, 'Авто \"City Truck\", пожежна машина', 'Коли в іграшковому світі вашої дитини виникають незаплановані ситуації, пожежна машина City Truck вступає в справу.', 'Коли в іграшковому світі вашої дитини виникають незаплановані прошествия, а хтось із солдатиків або роботів потребує термінової підмогу, пожежна машина City Truck вступає в справу. Вона із задоволенням буде виїжджати на завдання, рятувати жителів вигаданого містечка і наводити порядок на його вулицях. Ця красива, виготовлена ​​з якісного поліпропілену модель від бренду Wader виглядає дуже яскраво і реалістично - увагу привертають тематичні жовті і червоні кольори, які вигідно контрастують з великими чорними колесами. Крізь переднє і бічні вікна чітко проглядається деталізований салон зі зручними кріслами для водія і його помічника, а над кабіною і кузовом гордо височить спеціальна сходи для рятувальних робіт на висоті. Бавлячись цією іграшкою, хлопчик буде не тільки весело проводити час, а й розвиватися, дізнаватися нові для себе факти з пожежної тематики і то, як влаштована подібного роду техніка. Вік: від 3 років Матеріал: поліпропілен Розміри: 45 х 22 х 19 см Комплектація: автомобіль Виробник: Wader Зроблено в: Польща', '02_cars/04_city_truck_firetruck.jpg', '429.0000', 2),
(5, 'Гра \"Великі джунглі\"', 'У гру можуть грати одночасно від 2-5 чоловік. Сеанс гри 15 хв. Мета гри: Для мишок: зібрати всі 10 шматочків сиру. ', 'У гру можуть грати одночасно від 2-5 чоловік. Сеанс гри 15 хв. Мета гри: Для мишок: зібрати всі 10 шматочків сиру. Для кішки: спіймати всіх чотирьох мишок, поки вони не зібрали весь сир. Партію виграє той, хто першим виконав своє завдання. Вік: з 6 років Розмір: 30х28х4 см Матеріал: картон Комплектація: 1 ігрове поле \"кухня\" 1 стіл, 4 фігурки мишки, 1 фігурка кішки, 2 кубика, 38 карток \"плитка\", 4 картки \"норка\" Виробник: Djeco Зроблено в : Франція', '03_desktop_games/05_game_big_jungles.jpg', '662.0000', 3),
(6, 'Настільна гра \"Чоп Чоп\"', 'У гру можуть грати одночасно від 2-5 чоловік. Сеанс гри 15 хв. Мета гри: Для мишок: зібрати всі 10 шматочків сиру.', 'У гру можуть грати одночасно від 2-5 чоловік. Сеанс гри 15 хв. Мета гри: Для мишок: зібрати всі 10 шматочків сиру. Для кішки: спіймати всіх чотирьох мишок, поки вони не зібрали весь сир. Партію виграє той, хто першим виконав своє завдання. Вік: з 6 років Розмір: 30х28х4 см Матеріал: картон Комплектація: 1 ігрове поле \"кухня\" 1 стіл, 4 фігурки мишки, 1 фігурка кішки, 2 кубика, 38 карток \"плитка\", 4 картки \"норка\" Виробник: Djeco Зроблено в : Франція', '03_desktop_games/06_game_chop_chop.jpg', '866.0000', 3),
(7, 'Ксилофон', 'Іграшки у вигляді різноманітних музичних інструментів дуже корисні і користуються великою популярністю серед малечі.', 'Іграшки у вигляді різноманітних музичних інструментів дуже корисні і користуються великою популярністю серед малечі. Всесвітньо відома німецька корпорація Bino виробляє чудові дитячі іграшки, для яких характерний власний фірмовий дизайн, європейські стандарти якості і багатофункціональність. Фахівцями фірми була розроблена ціла серія іграшок музичної спрямованості і однією з найяскравіших моделей є нескладний, однак, дуже ефектний «Ксилофон». Кожна з дванадцяти клавіш має свій власний колір, розмір і характер звучання. Грати на «ксилофон» дитина зможе за допомогою пари паличок з булавою на кінці. Розмір іграшки становить всього 33х21х3,3 сантиметрів, що дозволяє брати її з собою в дитячий садок, на пікнік або прогулянку. Для виробництва музичного інструменту було використано приємне на дотик натуральне дерево, що не володіє токсичними властивостями. Покрита іграшка яскравими не завдають шкоди довкіллю фарбами, а укріплений «Ксилофон» якісними металевими вставками. Найцікавішою представлена ​​модель буде для хлопчиків і дівчаток віком від трьох років, які проявляють інтерес до творчості. Гра на такому музичному інструменті розвиває слух, моторику, уяву, пам\'ять, координацію рух і розширює свідомість малюка. Розміри: 33x21,5x3,5 см Вік: 3+ Матеріал: дерево, метал Виробник: Bino (Німеччина) Зроблено в: Німеччина Комплектація: ксилофон, дві палички для гри Артикул: 86554', '04_music_games/07_xylophone.jpg', '447.0000', 4),
(8, 'Гітара 4 струни \"Kulele\"', 'Гітара бренду Shantou - прекрасний сюрприз для активного малюка старше 3-х років.', 'Гітара бренду Shantou - прекрасний сюрприз для активного малюка старше 3-х років. Виготовлена ​​з міцного і безпечного для здоров\'я матеріалу, вона прикрашена зображеннями мультяшних героїв, які обумовили її привабливість для дошкільнят. Такий чотириструнний музичний інструмент, безумовно, дарує чудовий настрій. За допомогою іграшки можна освоювати ази гри на гітарі, уявляючи себе популярним виконавцем, виступаючим на великій сцені і насолоджується нескінченними оплесками. Вік: від 3 років Матеріал: пластик Розміри: 23х61,5х9 см Комплектація: гітара Виробник: Shantou Зроблено в: Китай', '04_music_games/08_ukulele.jpg', '217.0000', 4);

--
-- Індекси збережених таблиць
--

--
-- Індекси таблиці `category`
--
ALTER TABLE `category`
  ADD PRIMARY KEY (`category_id`);

--
-- Індекси таблиці `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`product_id`),
  ADD KEY `category_id` (`category_id`);

--
-- AUTO_INCREMENT для збережених таблиць
--

--
-- AUTO_INCREMENT для таблиці `category`
--
ALTER TABLE `category`
  MODIFY `category_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;
--
-- AUTO_INCREMENT для таблиці `product`
--
ALTER TABLE `product`
  MODIFY `product_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;
--
-- Обмеження зовнішнього ключа збережених таблиць
--

--
-- Обмеження зовнішнього ключа таблиці `product`
--
ALTER TABLE `product`
  ADD CONSTRAINT `product_ibfk_1` FOREIGN KEY (`category_id`) REFERENCES `category` (`category_id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
